app/views/post_images/_list.html.erb

                    <li>
                    <%= link_to "#{post_image.post_comments.count} コメント", post_image_path(post_image.id) %>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 7]]